<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class FacilitiesTableSeeder extends Seeder
{
    public function run(): void
    {
        DB::table('facilities')->insert([
            [
                'name' => 'Бесплатный WI-FI',                
            ],
            [
                'name' => 'Холодильник',                
            ],
             [
                'name' => 'Телевизор LCD',                
            ],
             [
                'name' => 'Кондиционер',                
            ],
             [
                'name' => 'Столик с лавочками +BBQ',                
            ],
             [
                'name' => 'Полотенца',                
            ],
             [
                'name' => 'Косметические принадлежности',                
            ],
             [
                'name' => 'Душевая кабина 1 санузел',                
            ],
             [
                'name' => 'Спальня: 1 большая двухспальная кровать 1 диван-кровать',                
            ],
             [
                'name' => 'Гостинная: 1 диван-кровать',                
            ],
             [
                'name' => 'Кухня',                
            ],
            [
                'name' => 'Спальня: 1 большая двухспальная кровать',                
            ],
            [
                'name' => 'Мансарда: 2 большие двухспальные кровати',                
            ],
            [
                'name' => 'Душевая кабина 2 санузла',                
            ],
            [
                'name' => 'Беседка + BBQ',                
            ],
            [
                'name' => 'Баня',                
            ],
            [
                'name' => 'Спальня- мансарда: 1 большая двухспальная кровать',                
            ],
            [
                'name' => 'Крытая терраса + BBQ',                
            ],
            [
                'name' => 'Спальня 1,2,3: большая двухспальная кровать',                
            ],
            [
                'name' => 'Спальня 4,5: две односпальные кровати',                
            ],
            [
                'name' => 'терраса',                
            ],
        ]);
    }
}
