<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class HousesTableSeeder extends Seeder
{
    public function run(): void
    {
        DB::table('houses')->insert([
            [
                'name' => 'Коричневый домик №1',
                'housetype_id' => '2',
                'description' => 'Вітражний будиночок запрошує розміститися 4-м гостям.  На першому поверсі розташований комфортний 2-х місний диван, а на поверсі під дахом 2-х спальне велике ліжко. На прибудинковій території бази відпочинку є місце для відпочинку та ігор на свіжому повітрі. Мангал із столом та лавками  знаходиться за будинком і є в розпоряджені гостя.',
                'featured_image' => 'brown-featured1.jpg',
                'galery_images' => 'brown1-1.jpg, brown1-2.jpg, brown1-3.jpg, brown1-4.jpg, brown1-5.jpg',                                
            ],
            [
                'name' => 'Коричневый домик №2',
                'housetype_id' => '2',
                'description' => 'Вітражний будиночок запрошує розміститися 4-м гостям.  На першому поверсі розташований комфортний 2-х місний диван, а на поверсі під дахом 2-х спальне велике ліжко. На прибудинковій території бази відпочинку є місце для відпочинку та ігор на свіжому повітрі. Мангал із столом та лавками  знаходиться за будинком і є в розпоряджені гостя.',
                'featured_image' => 'brown-featured2.jpg',
                'galery_images' => 'brown2-1.jpg, brown2-2.jpg, brown2-3.jpg, brown2-4.jpg, brown2-5.jpg',                                
            ],
            [
                'name' => 'Коричневый домик №3',
                'housetype_id' => '2',
                'description' => 'Вітражний будиночок запрошує розміститися 4-м гостям.  На першому поверсі розташований комфортний 2-х місний диван, а на поверсі під дахом 2-х спальне велике ліжко. На прибудинковій території бази відпочинку є місце для відпочинку та ігор на свіжому повітрі. Мангал із столом та лавками  знаходиться за будинком і є в розпоряджені гостя.',
                'featured_image' => 'brown-featured3.jpg',
                'galery_images' => 'brown3-1.jpg, brown3-2.jpg, brown3-3.jpg, brown3-4.jpg, brown3-5.jpg',                                
            ],            
        ]);
    }
}
