<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class HousesTableSeeder extends Seeder
{
    public function run(): void
    {
        DB::table('houses')->insert([
            [
                'name' => 'Белый домик',
                'housetype_id' => '1',
                'description' => 'Білий будиночок запрошує з комфортом розміститися сімї або компанії друзів до 8-ми осіб. У просторій спальні встановлено 2-х спальне ліжко. У залі із затишним каміном встановлений великий диван, на якому можуть розміститися ще 2 особи, а на поверсі під дахом вас зустрінуть 2 затишні спальні простори з великими 2-х спальними ліжками.',
                'featured_image' => 'white-featured1.jpg',
                'galery_images' => 'white-1.jpg, white-2.jpg, white-3.jpg',                                
            ],
            [
                'name' => 'Коричневый домик №1',
                'housetype_id' => '2',
                'description' => "Коричневий будиночок для гостей у два поверхи розмістить на своїй території сім'ю або компанію друзів із 4 осіб. У просторій спальні встановлено зручне двоспальне ліжко і диван, на якому можуть розміститися 2 дитини. У вітальні з затишним каміном встановлений диван, на якому можуть розміститися ще 2 людини.",
                'featured_image' => 'brown-featured1.jpg',
                'galery_images' => 'brown1-1.jpg, brown1-2.jpg, brown1-3.jpg, brown1-4.jpg, brown1-5.jpg',                                
            ],
            [
                'name' => 'Коричневый домик №2',
                'housetype_id' => '2',
                'description' => "Коричневий будиночок для гостей у два поверхи розмістить на своїй території сім'ю або компанію друзів із 4 осіб. У просторій спальні встановлено зручне двоспальне ліжко і диван, на якому можуть розміститися 2 дитини. У вітальні з затишним каміном встановлений диван, на якому можуть розміститися ще 2 людини.",
                'featured_image' => 'brown-featured2.jpg',
                'galery_images' => 'brown2-1.jpg, brown2-2.jpg, brown2-3.jpg, brown2-4.jpg, brown2-5.jpg',                                
            ],
            [
                'name' => 'Коричневый домик №3',
                'housetype_id' => '2',
                'description' => "Коричневий будиночок для гостей у два поверхи розмістить на своїй території сім'ю або компанію друзів із 4 осіб. У просторій спальні встановлено зручне двоспальне ліжко і диван, на якому можуть розміститися 2 дитини. У вітальні з затишним каміном встановлений диван, на якому можуть розміститися ще 2 людини.",
                'featured_image' => 'brown-featured3.jpg',
                'galery_images' => 'brown3-1.jpg, brown3-2.jpg, brown3-3.jpg, brown3-4.jpg, brown3-5.jpg',                                
            ], 
            [
                'name' => 'Витражный домик №1',
                'housetype_id' => '3',
                'description' => "Вітражний будиночок запрошує розміститися 4-м гостям.  На першому поверсі розташований комфортний 2-х місний диван, а на поверсі під дахом 2-х спальне велике ліжко. На прибудинковій території бази відпочинку є місце для відпочинку та ігор на свіжому повітрі. Мангал із столом та лавками  знаходиться за будинком і є в розпоряджені гостя.",
                'featured_image' => 'stained-glass-featured1.jpg',
                'galery_images' => 'stained-glass-1-1.jpg, stained-glass-1-2.jpg, stained-glass-1-3.jpg',                                
            ], 
            [
                'name' => 'Витражный домик №2',
                'housetype_id' => '3',
                'description' => "Вітражний будиночок запрошує розміститися 4-м гостям.  На першому поверсі розташований комфортний 2-х місний диван, а на поверсі під дахом 2-х спальне велике ліжко. На прибудинковій території бази відпочинку є місце для відпочинку та ігор на свіжому повітрі. Мангал із столом та лавками  знаходиться за будинком і є в розпоряджені гостя.",
                'featured_image' => 'stained-glass-featured2.jpg',
                'galery_images' => 'stained-glass-2-1.jpg, stained-glass-2-2.jpg, stained-glass-2-3.jpg',                                
            ],
            [
                'name' => 'Лавандовый домик',
                'housetype_id' => '4',
                'description' => "Лавандовий будиночок (площа 165м2) оформлений у французькому стилі Прованс може розмістити велику компанію друзів до 10 людей, яким буде затишно на своїй окремій території. Двоповерховий зруб має 5 окремих спалень зі зручними ортопедичними матрацами для солодких снів, кухня та їдальня з великим столом на 10 людей, вітальню з каміном,крита тераса, 2 С/У, душеву,. У величезній вітальні є затишний великий диван для відпочинку, окрема кухня з виходом на велику терасу. Усередині будинку на даний момент лазня не працює, є окрема лазня на дровах на території бази відпочинку.",
                'featured_image' => 'lavanda-featured',
                'galery_images' => 'lavanda-1.jpg, lavanda-2.jpg, lavanda-3.jpg',                                
            ], 
            [
                'name' => 'Оливковый домик',
                'housetype_id' => '5',
                'description' => "Оливковий будиночок (площа 165м2) оформлений у французькому стилі Прованс може розмістити велику компанію друзів до 10 людей, яким буде затишно на своїй окремій території. Двоповерховий зруб має 5 окремих спалень зі зручними ортопедичними матрацами для солодких снів, кухня та їдальня з великим столом на 10 людей, вітальню з каміном,крита тераса, 2 С/У, душеву,. У величезній вітальні є затишний великий диван для відпочинку, окрема кухня з виходом на велику терасу. Усередині будинку на даний момент лазня не працює, є окрема лазня на дровах на території бази відпочинку.",
                'featured_image' => 'olive-featured',
                'galery_images' => 'olive-1.jpg, olive-2.jpg, olive-3.jpg, olive-4.jpg',                                
            ],            
            [
                'name' => 'Васильковый домик',
                'housetype_id' => '6',
                'description' => "Васильковий будиночок (площа 165м2) оформлений у французькому стилі Прованс може розмістити велику компанію друзів до 10 людей, яким буде затишно на своїй окремій території. Двоповерховий зруб має 5 окремих спалень зі зручними ортопедичними матрацами для солодких снів, кухня та їдальня з великим столом на 10 людей, вітальню з каміном,крита тераса, 2 С/У, душеву,. У величезній вітальні є затишний великий диван для відпочинку, окрема кухня з виходом на велику терасу. Усередині будинку на даний момент лазня не працює, є окрема лазня на дровах на території бази відпочинку.",
                'featured_image' => 'vasilk',
                'galery_images' => 'vasilk-1.jpg, vasilk-2.jpg, vasilk-3.jpg',                                
            ],         
        ]);
    }
}
